hpmicro/hpm_sdk/soc/HPM6700/HPM64G0/HPM64G0_svd.xml
        <register>
          <name>CMD_STA_CMD_CTRL</name>
          <description>config, status, command and control bits</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x00900080</resetValue>
          <resetMask>0xFBF3FFFF</resetMask>
          <fields>
            <field>
              <name>SACK</name>
              <description>Self-ACKnowledge
0 – no self-ACK
1 – self-ACK when LBME=1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM</name>
              <description>Receive buffer Overflow Mode
In case of a full RBUF when a new message is received, then ROM selects the following:
1 – The new message will not be stored.
0 – The oldest message will be overwritten.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROV</name>
              <description>Receive buffer OVerflow
1 – Overflow. At least one message is lost.
0 – No Overflow.
ROV is cleared by setting RREL=1.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RREL</name>
              <description>Receive buffer RELease
The host controller has read the actual RB slot and releases it. Afterwards the CAN-CTRL
core points to the next RB slot. RSTAT gets updated.
1 – Release: The host has read the RB.
0 – No release</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RBALL</name>
              <description>Receive Buffer stores ALL data frames
0 – normal operation
1 – RB stores correct data frames as well as data frames with error</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTAT</name>
              <description>Receive buffer STATus
00 - empty
01 - &gt; empty and &lt; almost full (AFWL)
10 -  almost full (programmable threshold by AFWL) but not full and no overflow
11 - full (stays set in case of overflow – for overflow signaling see ROV)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FD_ISO</name>
              <description>CAN FD ISO mode
0 - Bosch CAN FD (non-ISO) mode
1 - ISO CAN FD mode (ISO 11898-1:2015)
ISO CAN FD mode has a different CRC initialization value and an additional stuff bit count.
Both modes are incompatible and must not be mixed in one CAN network.
This bit has no impact to CAN 2.0B.
This bit is only writeable if RESET=1.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSNEXT</name>
              <description>Transmit buffer Secondary NEXT
0 - no action
1 - STB slot filled, select next slot.
After all frame bytes are written to the TBUF registers, the host controller has to set
TSNEXT to signal that this slot has been filled. Then the CAN-CTRL core connects the TBUF
registers to the next slot. Once a slot is marked as filled a transmission can be started
using TSONE or TSALL.
It is possible to set TSNEXT and TSONE or TSALL together in one write access.
TSNEXT has to be set by the host controller and is automatically reset by the CAN-CTRL
core immediately after it was set.
Setting TSNEXT is meaningless if TBSEL=0. In this case TSNEXT is ignored and
automatically cleared. It does not do any harm.
If all slots of the STB are filled, TSNEXT stays set until a slot becomes free.
TSNEXT has no meaning in TTCAN mode and is fixed to 0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSMODE</name>
              <description>Transmit buffer Secondary operation MODE
0 - FIFO mode
1 - priority decision mode
In FIFO mode frames are transmitted in the order in that they are written into the STB.
In priority decision mode the frame with the highest priority in the STB is automatically
transmitted first. The ID of a frame is used for the priority decision. A lower ID means a
higher priority of a frame. A frame in the PTB has always the highest priority regardless of
the ID.
TSMODE shall be switched only if the STB if empty</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTTBM</name>
              <description>TTCAN Transmit Buffer Mode
If TTEN=0 then TTTBM is ignored, otherwise the following is valid:
0 - separate PTB and STB, behavior defined by TSMODE
1 - full TTCAN support: buffer slots selectable by TBPTR and TTPTR
For event-driven CAN communication (TTEN=0), the system provides PTB and STB and
the behavior of the STB is defined by TSMODE. Then TTTBM is ignored.
For time-triggered CAN communication (TTEN=1) with full support of all features including
time-triggered transmissions, TTTBM=1 needs to be chosen. Then the all TB slots are
addressable using TTPTR and TBPTR.
For time-triggered CAN communication (TTEN=1) with only support of reception timestamps, TTTBM=0 can be chosen. Then the transmit buffer acts as in event-driven mode
and the behavior can be selected by TSMODE.
TTTBM shall be switched only if the TBUF is empty.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSSTAT</name>
              <description>Transmission Secondary STATus bits
If TTEN=0 or TTTBM=0:
00 – STB is empty
01 – STB is less than or equal to half full
10 – STB is more than half full
11 – STB is full
If the STB is disabled using STB_DISABLE, then TSSTAT=00.
If TTEN=1 and TTTBM=1:
00 – PTB and STB are empty
01 – PTB and STB are not empty and not full
11 – PTB and STB are full</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TBSEL</name>
              <description>Transmit Buffer Select
Selects the transmit buffer to be loaded with a message. Use the TBUF registers for
access. TBSEL needs to be stable all the time the TBUF registers are written and when
TSNEXT is set.
0 - PTB (high-priority buffer)
1 - STB
The bit will be reset to the hardware reset value if (TTEN=1 and TTTBM=1)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOM</name>
              <description>Listen Only Mode
0 - Disabled
1 - Enabled
LOM cannot be set if TPE, TSONE or TSALL is set. No transmission can be started if LOM
is enabled and LBME is disabled.
LOM=1 and LBME=0 disables all transmissions.
LOM=1 and LBME=1 disables the ACK for received frames and error frames, but enables
the transmission of own frames.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY</name>
              <description>Transceiver Standby Mode
0 - Disabled
1 - Enabled
This register bit is connected to the output signal stby which can be used to control a
standby mode of a transceiver.
STBY cannot be set to 1 if TPE=1, TSONE=1 or TSALL=1.
If the host sets STBY to 0 then the host needs to wait for the time required by the
transceiver to start up before the host requests a new transmission.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPE</name>
              <description>Transmit Primary Enable
1 - Transmission enable for the message in the high-priority PTB
0 - No transmission for the PTB
If TPE is set, the message from the PTB will be transmitted at the next possible transmit
position. A started transmission from the STB will be completed before, but pending new
messages are delayed until the PTB message has been transmitted.
TPE stays set until the message has been transmitted successfully or it is aborted using
TPA.
The host controller can set TPE to 1 but can not reset it to 0. This would only be possible
using TPA and aborting the message.
The bit will be reset to the hardware reset value if RESET=1, STBY=1, (LOM=1 and
LBME=0) or (TTEN=1 and TTTBM=1).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPA</name>
              <description>Transmit Primary Abort
1 – Aborts a transmission from PTB which has been requested by TPE=1 but not
started yet. (The data bytes of the message remains in the PTB.)
0 – no abort
The bit has to be set by the host controller and will be reset by CAN-CTRL. Setting TPA
automatically de-asserts TPE.
The host controller can set TPA to 1 but can not reset it to 0.
During the short time while the CAN-CTRL core resets the bit, it cannot be set by the
host.
The bit will be reset to the hardware reset value if RESET=1 or (TTEN=1 and TTTBM=1).
TPA should not be set simultaneously with TPE.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSONE</name>
              <description>Transmit Secondary ONE frame
1 – Transmission enable of one in the STB. In FIFO mode this is the oldest message
and in priority mode this is the one with the highest priority.
TSONE in priority mode is difficult to handle, because it is not always clear which
message will be transmitted if new messages are written to the STB meanwhile.
The controller starts the transmission as soon as the bus becomes vacant and
no request of the PTB (bit TPE) is pending.
0 – No transmission for the STB.
TSONE stays set until the message has been transmitted successfully or it is aborted
using TSA.
The host controller can set TSONE to 1 but can not reset it to 0. This would only be
possible using TSA and aborting the message.
The bit will be reset to the hardware reset value if RESET=1, STBY=1, (LOM=1 and
LBME=0) or (TTEN=1 and TTTBM=1).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSALL</name>
              <description>Transmit Secondary ALL frames
1 – Transmission enable of all messages in the STB.
The controller starts the transmission as soon as the bus becomes vacant and
no request of the PTB (bit TPE) is pending.
0 – No transmission for the STB.
TSALL stays set until all messages have been transmitted successfully or they are aborted
using TSA.
The host controller can set TSALL to 1 but can not reset it to 0. This would only be
possible using TSA and aborting the messages.
The bit will be reset to the hardware reset value if RESET=1, STBY=1, (LOM=1 and
LBME=0) or (TTEN=1 and TTTBM=1).
If during a transmission the STB is loaded with a new frame then the new frame will be
transmitted too. In other words: a transmission initiated by TSALL is finished when the
STB becomes empty.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSA</name>
              <description>Transmit Secondary Abort
1 – Aborts a transmission from STB which has been requested but not started yet.
For a TSONE transmission, only one frame is aborted while for a TSALL
Transmission, all frames are aborted.
One or all message slots will be released which updates TSSTAT.
All aborted messages are lost because they are not accessible any more.
If in priority mode a TSONE transmission is aborted, then it is not clear which
frame will be aborted if new frames are written to the STB meanwhile.
0 – no abort
The bit has to be set by the host controller and will be reset by CAN-CTRL. Setting TSA,automatically de-asserts TSONE or TSALL respectively.
The host controller can set TSA to 1 but can not reset it to 0.
The bit will be reset to the hardware reset value if RESET=1.
TSA should not be set simultaneously with TSONE or TSALL.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>RESET request bit
1 - The host controller performs a local reset of CAN-CTRL.
0 - no local reset of CAN-CTRLThe some register (e.g for node configuration) can only be modified if RESET=1.
Bit RESET forces several components to a reset state.
RESET is automatically set if the node enters “bus off” state.
Note that a CAN node will participate in CAN communication after RESET is switched to 0after 11 CAN bit times.
This delay is required by the CAN standard (bus idle time).If RESET is set to 1 and immediately set to 0, then it takes some time until RESET can beread as 0 and becomes inactive.
The reason is clock domain crossing from host to CAN clockdomain. RESET is held active as long as needed depending on the relation between host andCAN clock.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBME</name>
              <description>Loop Back Mode, External
0 - Disabled
1 - EnabledLBME should not be enabled while a transmission is active</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBMI</name>
              <description>Loop Back Mode, Internal
0 - Disabled1 - EnabledLBMI should not be enabled while a transmission is active.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPSS</name>
              <description>Transmission Primary Single Shot mode for PTB
0 - Disabled
1 - Enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSSS</name>
              <description>Transmission Secondary Single Shot mode for STB
0 - Disabled
1 - Enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RACTIVE</name>
              <description>Reception ACTIVE (Receive Status bit)
1 - The controller is currently receiving a frame.
0 - No receive activity.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TACTIVE</name>
              <description>Transmission ACTIVE (Transmit Status bit)
1 - The controller is currently transmitting a frame.
0 - No transmit activity.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSOFF</name>
              <description>Bus Off (Bus Status bit)
1 - The controller status is “bus off”.
0 - The controller status is “bus on”.
Writing a 1 to BUSOFF will reset TECNT and RECNT. This should be done only for debugging.
See Chapter 3.9.10.6 for details.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTIE</name>
          <description>Receive and Transmit Interrupt Enable Register RTIE</description>
          <addressOffset>0xa4</addressOffset>
          <size>8</size>
          <resetValue>0xFE</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>RIE</name>
              <description>Receive Interrupt Enable
0 – Disabled, 1 – Enabled</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROIE</name>
              <description>RB Overrun Interrupt Enable
0 – Disabled, 1 – Enabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFIE</name>
              <description>RB Full Interrupt Enable
0 – Disabled, 1 – Enabled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAFIE</name>
              <description>RB Almost Full Interrupt Enable
0 – Disabled, 1 – Enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPIE</name>
              <description>Transmission Primary Interrupt Enable
0 – Disabled, 1 – Enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIE</name>
              <description>Transmission Secondary Interrupt Enable
0 – Disabled, 1 – Enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIE</name>
              <description>Error Interrupt Enable
0 – Disabled, 1 – Enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSFF</name>
              <description>If TTEN=0 or TTTBM=0: Transmit Secondary buffer Full Flag
1 - The STB is filled with the maximal number of messages.
0 - The STB is not filled with the maximal number of messages.
If the STB is disabled using STB_DISABLE, then TSFF=0.
If TTEN=1 and TTTBM=1: Transmit buffer Slot Full Flag
1 - The buffer slot selected by TBPTR is filled.
0 - The buffer slot selected by TBPTR is empty.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTIF</name>
          <description>Receive and Transmit Interrupt Flag Register RTIF (0xa5)</description>
          <addressOffset>0xa5</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>RIF</name>
              <description>Receive Interrupt Flag
1 - Data or a remote frame has been received and is available in the receive buffer.
0 - No frame has been received.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ROIF</name>
              <description>RB Overrun Interrupt Flag
1 - At least one received message has been overwritten in the RB.
0 - No RB overwritten.
In case of an overrun both ROIF and RFIF will be set.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RFIF</name>
              <description>RB Full Interrupt Flag
1 - All RBs are full. If no RB will be released until the next valid message is received,
the oldest message will be lost.
0 - The RB FIFO is not full.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RAFIF</name>
              <description>RB Almost Full Interrupt Flag
1 - number of filled RB slots &gt;= AFWL_i
0 - number of filled RB slots &lt; AFWL_i</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TPIF</name>
              <description>Transmission Primary Interrupt Flag
1 - The requested transmission of the PTB has been successfully completed.
0 - No transmission of the PTB has been completed.
In TTCAN mode, TPIF will never be set. Then only TSIF is valid.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TSIF</name>
              <description>Transmission Secondary Interrupt Flag
1 - The requested transmission of the STB has been successfully completed.
0 - No transmission of the STB has been completed successfully.
In TTCAN mode TSIF will signal all successful transmissions, regardless of storage location of
the message.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EIF</name>
              <description>Error Interrupt Flag
1 - The border of the error warning limit has been crossed in either direction,
or the BUSOFF bit has been changed in either direction.
0 - There has been no change.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AIF</name>
              <description>Abort Interrupt Flag
1 - After setting TPA or TSA the appropriated message(s) have been aborted.
It is recommended to not set both TPA and TSA simultaneously because both
source AIF.
0 - No abort has been executed.
The AIF does not have an associated enable register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
