hpmicro/hpm_sdk/soc/HPM6700/HPM64G0/HPM64G0_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="SDXC0">
      <name>SDXC1</name>
      <description>SDXC1</description>
      <groupName>SDXC</groupName>
      <baseAddress>0xf2034000</baseAddress>
    </peripheral>
    <peripheral>
      <name>CONCTL</name>
      <description>CONCTL</description>
      <groupName>CONCTL</groupName>
      <baseAddress>0xf2040000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ctrl0</name>
          <description>No description available</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF0FFFFF</resetMask>
          <fields>
            <field>
              <name>ENET1_RXCLK_DLY_SEL</name>
              <description>No description available</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET1_TXCLK_DLY_SEL</name>
              <description>No description available</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET0_RXCLK_DLY_SEL</name>
              <description>No description available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET0_TXCLK_DLY_SEL</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ctrl2</name>
          <description>No description available</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x2008F400</resetMask>
          <fields>
            <field>
              <name>ENET0_LPI_IRQ_EN</name>
              <description>ENET0 LPI IRQ Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET0_REFCLK_OE</name>
              <description>No description available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET0_PHY_INTF_SEL</name>
              <description>000:Reserved
001:RGMII
100:RMII
111:Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET0_FLOWCTRL</name>
              <description>No description available</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET0_RMII_TXCLK_SEL</name>
              <description>default to use internal clk.
set from pad， two option here:
  internal 50MHz clock out to pad then in;
  use external clock;</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ctrl3</name>
          <description>No description available</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x2008F400</resetMask>
          <fields>
            <field>
              <name>ENET1_LPI_IRQ_EN</name>
              <description>ENET1 LPI Interrupt Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET1_REFCLK_OE</name>
              <description>No description available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET1_PHY_INTF_SEL</name>
              <description>No description available</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET1_FLOWCTRL</name>
              <description>No description available</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET1_RMII_TXCLK_SEL</name>
              <description>No description available</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ctrl4</name>
          <description>No description available</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xDFFFF800</resetMask>
          <fields>
            <field>
              <name>SDXC0_SYS_IRQ_EN</name>
              <description>system irq enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC0_WKP_IRQ_EN</name>
              <description>wakeup irq enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC0_CARDCLK_INV_EN</name>
              <description>card clock inverter enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC0_GPR_TUNING_CARD_CLK_SEL</name>
              <description>for card clock DLL, default 0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC0_GPR_TUNING_STROBE_SEL</name>
              <description>for strobe DLL, default 7taps(1ns)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC0_GPR_STROBE_IN_ENABLE</name>
              <description>enable strobe clock, maybe used when update strobe DLL</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC0_GPR_CCLK_RX_DLY_SW_SEL</name>
              <description>No description available</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC0_GPR_CCLK_RX_DLY_SW_FORCE</name>
              <description>force use sw DLL config</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ctrl5</name>
          <description>No description available</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xDFFFF800</resetMask>
          <fields>
            <field>
              <name>SDXC1_SYS_IRQ_EN</name>
              <description>system irq enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC1_WKP_IRQ_EN</name>
              <description>wakeup irq enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC1_CARDCLK_INV_EN</name>
              <description>card clock inverter enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC1_GPR_TUNING_CARD_CLK_SEL</name>
              <description>No description available</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC1_GPR_TUNING_STROBE_SEL</name>
              <description>No description available</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC1_GPR_STROBE_IN_ENABLE</name>
              <description>No description available</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC1_GPR_CCLK_RX_DLY_SW_SEL</name>
              <description>No description available</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDXC1_GPR_CCLK_RX_DLY_SW_FORCE</name>
              <description>No description available</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
